### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-18T02:23:43.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:39",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:32" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:32/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/d7393fd96df5d731d4aff9d7fc6d3299e52c4b74887806c9c44aac5e232e02c8.zip" -> "lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip"
!       s3_object_version              = "7NRBHZaeksDuX0H_puSt3SVe0iMiRD_k" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "32" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "cataprato-auth-lambda"
+       id                  = (known after apply)
+       principal           = "apigateway.amazonaws.com"
+       qualifier           = (known after apply)
+       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:qkcy9ocpg8/*/*"
+       statement_id        = "APIGatewayAny"
+       statement_id_prefix = (known after apply)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "76cdb2bad9582d23c1f6f4d868218d6c" -> (known after apply)
!       id                     = "lambda-builds/d7393fd96df5d731d4aff9d7fc6d3299e52c4b74887806c9c44aac5e232e02c8.zip" -> (known after apply)
!       key                    = "lambda-builds/d7393fd96df5d731d4aff9d7fc6d3299e52c4b74887806c9c44aac5e232e02c8.zip" -> "lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/d7393fd96df5d731d4aff9d7fc6d3299e52c4b74887806c9c44aac5e232e02c8.zip" -> "./.terraform/lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "7NRBHZaeksDuX0H_puSt3SVe0iMiRD_k" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "set:filter",
+                       [
+                           "!app/.*",
                        ],
                    ],
+                   [
+                       "zip:embedded",
+                       "app",
+                       "app/",
                    ],
+                   [
+                       "clear:filter",
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "2382442657537744399" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/d7393fd96df5d731d4aff9d7fc6d3299e52c4b74887806c9c44aac5e232e02c8.zip" -> "./.terraform/lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip"
!           "timestamp" = "1692325362889819000" -> "1692325782481729000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "6308322051905050526" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/d7393fd96df5d731d4aff9d7fc6d3299e52c4b74887806c9c44aac5e232e02c8.zip" -> "./.terraform/lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip"
!           "original_source_code" = jsonencode(
!               [
!                   {
!                       path     = "." -> "./app"
                        # (2 unchanged attributes hidden)
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:39" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-18T02:23:43.091+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:39" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/e0e217eebe46ebf0dec45f259c818464bbe3de11047b8d01877ce7f56a935b69.zip" -> "builds/45fbb93c308a417026bf5e18774f3f80bf5a45d33ea957c068992b6876763d10.zip"
!       s3_object_version           = "WYJlvw_WiXhvv0VAxtWc17GP10aRQFLL" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "SOPX3Pf6rlw3lKo6Anv6X31Oe657cUrxw8rRzMIQv/I=" -> (known after apply)
!       source_code_size            = 29718695 -> (known after apply)
!       version                     = "39" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "8a9137894eac881eb0aeca91a8e0cea9-6" -> (known after apply)
!       id                     = "builds/e0e217eebe46ebf0dec45f259c818464bbe3de11047b8d01877ce7f56a935b69.zip" -> (known after apply)
!       key                    = "builds/e0e217eebe46ebf0dec45f259c818464bbe3de11047b8d01877ce7f56a935b69.zip" -> "builds/45fbb93c308a417026bf5e18774f3f80bf5a45d33ea957c068992b6876763d10.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/e0e217eebe46ebf0dec45f259c818464bbe3de11047b8d01877ce7f56a935b69.zip" -> "builds/45fbb93c308a417026bf5e18774f3f80bf5a45d33ea957c068992b6876763d10.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "WYJlvw_WiXhvv0VAxtWc17GP10aRQFLL" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/45fbb93c308a417026bf5e18774f3f80bf5a45d33ea957c068992b6876763d10.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/45fbb93c308a417026bf5e18774f3f80bf5a45d33ea957c068992b6876763d10.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7025978621763106012" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/e0e217eebe46ebf0dec45f259c818464bbe3de11047b8d01877ce7f56a935b69.zip" -> "builds/45fbb93c308a417026bf5e18774f3f80bf5a45d33ea957c068992b6876763d10.zip"
!           "timestamp" = "1692325361766428000" -> "1692325784002861000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "4509604886647257377" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/e0e217eebe46ebf0dec45f259c818464bbe3de11047b8d01877ce7f56a935b69.zip" -> "builds/45fbb93c308a417026bf5e18774f3f80bf5a45d33ea957c068992b6876763d10.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 7 to destroy.
```
</details>